Autodesk.Revit.UI.Selection.Selection.SetReferences(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Reference})
Selects the references. The references can be an element or a subelement in the host or a linked document.
Remarks:
This function will select the specified references and update the UI.
references:
The references to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Changing the selection is not permitted while handling SelectionChanged Event.
Since:
2023

Autodesk.Revit.UI.Selection.Selection.SetElementIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Selects the elements.
Remarks:
This function will select the specified elements within the project and update the UI.
See SetReferences for more selection options.
elementIds:
The ids of the elements to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Changing the selection is not permitted while handling SelectionChanged Event.
Since:
2015